
#ifndef _NX_CLOCKCONTROL_DEF_H_
#define _NX_CLOCKCONTROL_DEF_H_

//======================================================================================================

//================================================
// define structure instance
//================================================
// clk on  : nx_cpuif_reg_write_one( CMUI_SYS_0_AXI_clk_enb, 1 );
// clk off : nx_cpuif_reg_write_one( CMUI_SYS_0_AXI_clk_enb, 1 );
//
// src  change : nx_cpuif_reg_write_one( CMUI_SYS_0_AXI_grp_clk_src , 3 );
// div change : 
//
// 	nx_cpuif_reg_write_one( CMUI_SYS_0_AXI_dy_div_val , 2 );
// 	while( 1 == nx_cpuif_reg_read_one( CMUI_SYS_0_AXI_dy_div_busy_st ) );
// 
//================================================
/* SYS */
  /* SYS[0] */
/* AXI  */
struct cmuc {
	unsigned int group_clock_source;		/* 0x000 */
	unsigned int group_all_divider_reset;		/* 0x004 */
	unsigned int group_gate_mode;			/* 0x008 */
	unsigned int clock_enable;			/* 0x00c */
	unsigned int __reserved0[0xD];			/* 0x010 - 0x040 */
	unsigned int divider_reset;			/* 0x044 */
	unsigned int dynamic_divider_value;		/* 0x048 */
	unsigned int dynamic_divider_stop;		/* 0x04c */
	unsigned int dynamic_divider_busy_status;	/* 0x050 */
	unsigned int __reserved1[0xB];			/* 0x054 - 0x7c */
};
//struct cmuc cmucarray[4];
#define CMUI_SYS_0_AXI_grp_clk_src		{&SFR_INFO.CMU_SYS[0], 0x200, 0, 32}
#define CMUI_SYS_0_AXI_grp_a_div_rst		{&SFR_INFO.CMU_SYS[0], 0x204, 0, 32}
#define CMUI_SYS_0_AXI_grp_gate_mode		{&SFR_INFO.CMU_SYS[0], 0x208, 0, 32}
#define CMUI_SYS_0_AXI_div_rst			{&SFR_INFO.CMU_SYS[0], 0x244, 0, 32}
#define CMUI_SYS_0_AXI_dy_div_val		{&SFR_INFO.CMU_SYS[0], 0x248, 0, 32}
#define CMUI_SYS_0_AXI_dy_div_stop		{&SFR_INFO.CMU_SYS[0], 0x24c, 0, 32}
#define CMUI_SYS_0_AXI_dy_div_busy_st		{&SFR_INFO.CMU_SYS[0], 0x250, 0, 32}
#define CMUI_SYS_0_AXI_clk_enb			{&SFR_INFO.CMU_SYS[0], 0x20c, 0, 1}
/* AHB  */
#define CMUI_SYS_0_AHB_grp_clk_src		{0,0,0,0}
#define CMUI_SYS_0_AHB_grp_a_div_rst		{0,0,0,0}
#define CMUI_SYS_0_AHB_grp_gate_mode		{0,0,0,0}
#define CMUI_SYS_0_AHB_div_rst			{&SFR_INFO.CMU_SYS[0], 0x284, 0, 32}
#define CMUI_SYS_0_AHB_dy_div_val		{&SFR_INFO.CMU_SYS[0], 0x288, 0, 32}
